casosAvanzados/retoEscalado/usandoCassandra/load/files/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="reto3server" port="80" type="tcp"></server>
  </servers>

  <load duration="10" unit="minute">
   <arrivalphase phase="1" duration="10" unit="minute">
     <users arrivalrate="500" unit="second"></users>
   </arrivalphase>
  </load>

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <for from="1" to="10" incr="1" var="counter">
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
          Now = os:timestamp(),
          {_, _, Micro} = Now,
          {{Year,Mon,Day},{Hour,Min,Sec}} = calendar:now_to_universal_time(Now),
          io_lib:format('~4..0b-~2..0b-~2..0b ~2..0b:~2..0b:~2..0b.~6..0b', [Year,Mon,Day,Hour,Min,Sec,Micro])
        end.">
        <var name="nowts" />
      </setdynvars>
      <request subst="true">
        <http url="/" method="POST" version="1.1" contents="value=%%_nowts%%"></http>
      </request>

    </for>
    
  </session>
 </sessions>
</tsung>